export const getAllMovies = () => [
  {
    id: 1,
    title: 'ฉลาดเกมส์โกง',
    coverImage: 'https://i0.wp.com/mereview.in.th/wp-content/uploads/2017/12/BadGenius.png?fit=1020%2C539',
    coverImageen: 'https://blogimg.goo.ne.jp/user_image/6d/a0/044a188e5d4ad028c661a7d3fa39d7e9.jpg',
    coverImagejp: 'https://pbs.twimg.com/media/DhJTX5zUYAAKqOx.jpg',
    link: 'https://www.imdb.com/title/tt6788942/',
    score: '7.7/10 IMDB',
    description: 'เรื่องราวของเด็กฉลาด กับภารกิจโกงข้อสอบ เปลี่ยนกระดาษคำตอบให้เป็นเงินล้าน ขอต้อนรับทุกคนเข้าสู่ ธุรกิจกลางสนามสอบ ของ ลิน (ชุติมณฑน์ จึงเจริญสุขยิ่ง) นักเรียนทุนเจ้าของเกรดเฉลี่ย 4.00 ทุกปีการศึกษา ธุรกิจที่มีจุดเริ่มต้นจากการช่วยเพื่อนสนิทอย่าง เกรซ (อิษยา ฮอสุวรรณ) เด็กกิจกรรมตัวยงแต่ผลการเรียนย่ำแย่ และ พัฒน์ (ธีรดนย์ ศุภพันธุ์ภิญโญ) เด็กบ้านรวยที่คิดว่าเงินซื้อได้ทุกอย่าง ด้วยการปันคำตอบกลางห้องสอบ จนกลายเป็นวงการลอกขนาดใหญ่ ที่นักเรียนหลายคนในโรงเรียนยินดีจ่ายค่าตอบแทนแบบสูงลิบ แลกกับการได้รับคำตอบจากอัจฉริยะอย่างลิน',
    unitPrice: 150,
    unitPriceCurrency: 'THB',
    trailerLink: 'line://app/1610804355-qd1eebZ0?page=movie&videoId=1',
    viewerLink: 'line://app/1610804355-qd1eebZ0?page=movie&videoId=1'
  },
  {
    id: 2,
    title: 'น้องพี่ที่รัก',
    coverImage: 'https://www.plapakpao.com/images/640/brotheroftheyear.jpg',
    link: 'https://www.imdb.com/title/tt8060408/',
    score: '6.7/10 IMDB',
    description: 'ตั้งแต่เด็ก ชัช (ซันนี่ สุวรรณเมธานนท์) คิดมาตลอดว่าน้องที่อยู่ในท้องแม่คือน้องชาย พอถึงวันที่แม่คลอดแล้วกลายเป็นน้องสาว ชัชจึงเซ็งระดับสิบ ความฝันที่จะได้เล่นหุ่นยนต์และเตะบอลแมนๆ กับน้องก็จบไป เพราะเล่นกับไอ้เจน (ญาญ่า อุรัสยา เสปอร์บันด์) ทีไร มันก็ร้องไห้งอแงทุกที ตั้งแต่เด็กจนโต ชัชกับเจนตีกันได้ ทุกเรื่อง เพราะเจนชอบทำตัวเหมือนเป็นแม่มากกว่าเป็นน้อง ส่วนชัชก็ชอบทำตัวเป็นภาระมากกว่าเป็นพี่ จะมีพี่ชายคนไหนที่ห่วยกว่าน้องสาวไปซะทุกด้าน ไม่ว่าจะเป็นเรื่องการเรียน กีฬา หน้าตา นิสัย แข่งกัน ยังไง เจนก็เพอร์เฟคกว่า เวลาเดียวที่ชัชจะโชว์เหนือทำตัวเป็นพี่ ก็คือตอนที่มีคนมาจีบเจน ชัชจะทำตัวกร่างไล่หนุ่มๆให้หนีหายไปหมด เหมือนเป็นการเอาคืน',
    unitPrice: 120,
    unitPriceCurrency: 'THB',
    trailerLink: 'line://app/1610804355-qd1eebZ0?page=movie&videoId=2',
    viewerLink: 'line://app/1610804355-qd1eebZ0?page=movie&videoId=2'
  },
  {
    id: 3,
    title: '2215 เชื่อบ้ากล้าก้าว',
    coverImage: 'https://thestandard.co/wp-content/uploads/2018/08/UPDATE-2215-%E0%B9%80%E0%B8%8A%E0%B8%B7%E0%B9%88%E0%B8%AD-%E0%B8%9A%E0%B9%89%E0%B8%B2-%E0%B8%81%E0%B8%A5%E0%B9%89%E0%B8%B2-%E0%B8%81%E0%B9%89%E0%B8%B2%E0%B8%A7_cover_.jpg',
    link: 'https://www.mangozero.com/2215-review/',
    score: '9/10 Mango Zero',
    description: 'จากปรากฏการณ์การวิ่งครั้งประวัติศาสตร์ระยะทางกว่าสองพันกิโลเมตร มีคนอาสามาร่วมขบวนวิ่งนับหมื่น มีคนยืนชะเง้อรอเซลฟี่อีกนับแสน มีผู้ชมทางบ้านนั่งจ้องหน้าจอไลฟ์อีกนับล้าน จนมีเงินระดมบริจาคเข้ามาให้โรงพยาบาลเกินหนึ่งพันสี่ร้อยล้าน! ทั้งหมดนี้.. เริ่มต้นเพราะคนหนึ่งคน อยู่บนเวที เขาคือศิลปินที่สะกดผู้ชมด้วยเพลงร็อคอันเร่าร้อนทรงพลัง อยู่บนถนน เขาคือนักวิ่งที่ทำสถิติวิ่งข้ามประเทศคนแรกของไทย แต่อยู่บนรถบ้าน เขาคือไอ้หนุ่มร่างผอม ติดกาแฟ ดื้อกับหมอ แถมยังตลกฝืด! ตลอด 55 วันของ "ก้าวคนละก้าว" ทุกเหตุการณ์ ทุกแง่มุม ทุกดราม่า น่าจะถูกเล่าออกสื่อไปหมดแล้ว.. ยกเว้นเรื่องราวจากกล้องตัวนี้ นี่คือภาพยนตร์สารคดีคลุกวงใน ที่จะพาคุณฝ่าฝูงชนไปค้นลึกถึงเบื้องหลังแรงขับของนักร้องน่องเหล็ก พี่ตูน-บอดี้สแลม ผู้แบกฝันฝ่าแดดลุยฝนไล่ตามความเชื่อไปจนถึงแสงสุดท้าย โดยทีมงานสารคดีทีมเดียวที่ตามติดถ่ายทำเข้านอกออกในแบบไม่เคาะประตู (ยกเว้นตอนเข้าห้องน้ำ) บนเส้นทางจากเบตงถึงแม่สาย มาค้นพบแรงบันดาลใจไปพร้อมกัน ทีละก้าว',
    unitPrice: 0,
    unitPriceCurrency: 'THB',
    trailerLink: 'line://app/1610804355-qd1eebZ0?page=movie&videoId=3',
    viewerLink: 'line://app/1610804355-qd1eebZ0?page=movie&videoId=3'
  }
]

export const getMoviesByTitle = (title) => getAllMovies().find(movie => movie.title === title)

export const getPurchasedMovies = () => [
  {
    id: 1,
    title: 'ฉลาดเกมส์โกง',
    coverImage: 'https://3.bp.blogspot.com/-o5TDBJZxS1E/WQ6ZpwUo2HI/AAAAAAAAAZg/rNl3hDxcYCIRoSGI2fflksRfzeEkl0CtwCLcB/s640/Bad_Genius.png',
    coverImageen: 'https://blogimg.goo.ne.jp/user_image/6d/a0/044a188e5d4ad028c661a7d3fa39d7e9.jpg',
    coverImagejp: 'https://pbs.twimg.com/media/DhJTX5zUYAAKqOx.jpg',
    link: 'https://www.imdb.com/title/tt6788942/',
    score: '7.7/10 IMDB',
    description: 'เรื่องราวของเด็กฉลาด กับภารกิจโกงข้อสอบ เปลี่ยนกระดาษคำตอบให้เป็นเงินล้าน ขอต้อนรับทุกคนเข้าสู่ ธุรกิจกลางสนามสอบ ของ ลิน (ชุติมณฑน์ จึงเจริญสุขยิ่ง) นักเรียนทุนเจ้าของเกรดเฉลี่ย 4.00 ทุกปีการศึกษา ธุรกิจที่มีจุดเริ่มต้นจากการช่วยเพื่อนสนิทอย่าง เกรซ (อิษยา ฮอสุวรรณ) เด็กกิจกรรมตัวยงแต่ผลการเรียนย่ำแย่ และ พัฒน์ (ธีรดนย์ ศุภพันธุ์ภิญโญ) เด็กบ้านรวยที่คิดว่าเงินซื้อได้ทุกอย่าง ด้วยการปันคำตอบกลางห้องสอบ จนกลายเป็นวงการลอกขนาดใหญ่ ที่นักเรียนหลายคนในโรงเรียนยินดีจ่ายค่าตอบแทนแบบสูงลิบ แลกกับการได้รับคำตอบจากอัจฉริยะอย่างลิน',
    unitPrice: 150,
    unitPriceCurrency: 'THB',
    trailerLink: 'line://app/1610804355-qd1eebZ0?page=movie&videoId=1',
    viewerLink: 'line://app/1610804355-qd1eebZ0?page=movie&videoId=1'
  },
  {
    id: 3,
    title: '2215 เชื่อบ้ากล้าก้าว',
    coverImage: 'https://thestandard.co/wp-content/uploads/2018/08/UPDATE-2215-%E0%B9%80%E0%B8%8A%E0%B8%B7%E0%B9%88%E0%B8%AD-%E0%B8%9A%E0%B9%89%E0%B8%B2-%E0%B8%81%E0%B8%A5%E0%B9%89%E0%B8%B2-%E0%B8%81%E0%B9%89%E0%B8%B2%E0%B8%A7_cover_.jpg',
    link: 'https://www.mangozero.com/2215-review/',
    score: '9/10 Mango Zero',
    description: 'จากปรากฏการณ์การวิ่งครั้งประวัติศาสตร์ระยะทางกว่าสองพันกิโลเมตร มีคนอาสามาร่วมขบวนวิ่งนับหมื่น มีคนยืนชะเง้อรอเซลฟี่อีกนับแสน มีผู้ชมทางบ้านนั่งจ้องหน้าจอไลฟ์อีกนับล้าน จนมีเงินระดมบริจาคเข้ามาให้โรงพยาบาลเกินหนึ่งพันสี่ร้อยล้าน! ทั้งหมดนี้.. เริ่มต้นเพราะคนหนึ่งคน อยู่บนเวที เขาคือศิลปินที่สะกดผู้ชมด้วยเพลงร็อคอันเร่าร้อนทรงพลัง อยู่บนถนน เขาคือนักวิ่งที่ทำสถิติวิ่งข้ามประเทศคนแรกของไทย แต่อยู่บนรถบ้าน เขาคือไอ้หนุ่มร่างผอม ติดกาแฟ ดื้อกับหมอ แถมยังตลกฝืด! ตลอด 55 วันของ "ก้าวคนละก้าว" ทุกเหตุการณ์ ทุกแง่มุม ทุกดราม่า น่าจะถูกเล่าออกสื่อไปหมดแล้ว.. ยกเว้นเรื่องราวจากกล้องตัวนี้ นี่คือภาพยนตร์สารคดีคลุกวงใน ที่จะพาคุณฝ่าฝูงชนไปค้นลึกถึงเบื้องหลังแรงขับของนักร้องน่องเหล็ก พี่ตูน-บอดี้สแลม ผู้แบกฝันฝ่าแดดลุยฝนไล่ตามความเชื่อไปจนถึงแสงสุดท้าย โดยทีมงานสารคดีทีมเดียวที่ตามติดถ่ายทำเข้านอกออกในแบบไม่เคาะประตู (ยกเว้นตอนเข้าห้องน้ำ) บนเส้นทางจากเบตงถึงแม่สาย มาค้นพบแรงบันดาลใจไปพร้อมกัน ทีละก้าว',
    unitPrice: 0,
    unitPriceCurrency: 'THB',
    trailerLink: 'line://app/1610804355-qd1eebZ0?page=movie&videoId=3',
    viewerLink: 'line://app/1610804355-qd1eebZ0?page=movie&videoId=3'
  }
]